{
  "name": "རི་ཀི་ཨི་ཝ་ས་ཀི།",
  "title": "མཉེན་ཆས་བཟོ་སྐྲུན་པ།",
  "contact": {
    "email": "rickyiwasaki@gmail.com",
    "phone": "+1 (949) 228-0083",
    "location": "Las Vegas, Nevada, USA",
    "linkedin": "linkedin.com/in/ricky-iwasaki",
    "github": "github.com/RickyIwasaki",
    "website": "https://ricky-iwasaki.com"
  },
  "summary": "མཉེན་ཆས་བཟོ་མཁན་གྱི་ཉམས་མྱོང་ཅན་ཞིག ལས་གཞི་ཆེན་པོའི་ཆེད་དུ་ལས་ཀ་བྱེད་པའི་གོ་སྐབས་གསར་པ་འཚོལ་བཞིན་ཡོད། གཞན་གྱིས་བེད་སྤྱོད་གཏོང་ཆེད་དུ་གསང་གྲངས་གསར་བཟོ་བྱེད་པའམ་ཡང་ན་ཁ་སྣོན་བྱེད་འདོད་ཡོད། ངའི་ལག་རྩལ་དེ་དྲ་རྒྱ་དང་བསྡུར་ན་ཆུང་ཆུང་ཡིན་པར་ཡིད་ཆེས་ཡོད། དེར་བརྟེན་ང་ལ་ལག་ཆ་གཞན་པ་དང་། ཞབས་ཞུ། ལས་རིམ་སྐད་ཡིག་གཞན་པ་བཅས་དང་ལས་ཀ་བྱེད་པར་ཧ་ཅང་དགའ་པོ་ཡོད།",
  "education": [
    {
      "degree": "མཉེན་ཆས་བཟོ་སྐྲུན་ལག་ཁྱེར།",
      "school": "སྤྲིན་བལ་གྱི་རྐང་རྩེད་སྤོ་ལོའི་སྡོད་ཁང་།",
      "dates": "༢༠༢༢ - ༢༠༢༣ བར།"
    },
    {
      "school": "ཀ་ལི་ཕོར་ནི་ཡ་མངའ་སྡེའི་ཕུལ་ལར་ཊོན་གཙུག་ལག་སློབ་གཉེར་ཁང་།",
      "location": "ཕུ་ལར་ཊོན། ཨ་རིའི་ཀ་ལི་ཕོར་ནི་ཡ།",
      "dates": "༢༠༢༡ - ༢༠༢༢ བར།"
    },
    {
      "degree": "མཐོ་འབྲིང་གི་ལག་ཁྱེར།",
      "school": "ཝུཌ་བྷི་རི་ཇི་སློབ་འབྲིང་།",
      "location": "ཨ་རིའི་ཀ་ལི་ཕོར་ནི་ཡའི་གྲོང་ཁྱེར་ཨིར་ཝིན།",
      "dates": "༢༠༡༦ - ༢༠༢༡ བར།"
    }
  ],
  "experience": [
    {
      "title": "མཉེན་ཆས་བཟོ་སྐྲུན་པ།",
      "company": "MS-ZONE LLC.",
      "location": "ཨ་རིའི་ཀ་ལི་ཕོར་ནི་ཡའི་གྲོང་ཁྱེར་ཨིར་ཝིན།",
      "dates": "༢༠༢༣ - ༢༠༢༤ བར།",
      "responsibilities": [
        "React དང་ Node.js བཀོལ་ནས་ཚད་འཇལ་ཐུབ་པའི་དྲ་རྒྱའི་མཉེན་ཆས་བཟོ་བཀོད་དང་ལག་བསྟར་བྱས།",
        "ཐོན་རྫས་དོ་དམ་པ་དང་མཉམ་དུ་དགོས་མཁོ་ལེགས་སྒྲིག་དང་དུས་ཐོག་ཏུ་མཁོ་སྤྲོད་འགན་ལེན་བྱས།",
        "དྲ་རྒྱའི་མཉེན་ཆས་ཆེད་དུ་RESTful APIsགསར་གཏོད་དང་རྒྱུན་སྲིང་བྱས།",
        "ལས་འགན་རང་འགུལ་ཅན་དང་ཕན་འབྲས་མཐོར་འདེགས་གཏོང་བའི་ཡིག་ཆ་བཟོས་པ།"
      ]
    },
    {
      "title": "ཐེན་ནིས་སློབ་སྟོན་པ་རོགས་པ།",
      "company": "ཨིར་ཝིན་གྲོང་ཁྱེར།",
      "location": "ཨ་རིའི་ཀ་ལི་ཕོར་ནི་ཡའི་གྲོང་ཁྱེར་ཨིར་ཝིན།",
      "dates": "༢༠༡༤ - ༢༠༡༩ བར།",
      "responsibilities": [
        "རྩེད་འགྲན་པ་༥ནས་༡༠བར་གྱི་རུ་ཁག་ནང་ཊེན་སི་ལག་རྩལ་སློབ་ཁྲིད་བྱེད་པ།",
        "སློབ་ཚན་དེ་རྩེད་འགྲན་པ་རྣམས་ལ་སྤྲོ་སྣང་ལྡན་པ་དང་སྤྲོ་སྣང་ལྡན་པ་བཟོ་བ།",
        "རྩེད་ཐང་སྟེང་གི་རྩེད་འགྲན་པ་ཚོའི་བདེ་འཇགས་ལ་འགན་འཁུར་དགོས། ལྷག་པར་དུ་ལོ་3དང་ལོ་60ཡི་རྩེད་འགྲན་པ་གཞོན་པ་དང་རྒན་པ་ལྟ་བུ།"
      ]
    },
    {
      "title": "ཕྱི་ཕྱོགས་ལས་རོགས་པ།",
      "company": "ཨེ་མ་ཛོན་གསར་བ།",
      "location": "ཨ་རིའི་ཀ་ལི་ཕོར་ནི་ཡའི་གྲོང་ཁྱེར་ཨིར་ཝིན།",
      "dates": "༢༠༢༤ - ༢༠༢༤ བར།",
      "responsibilities": [
        "བང་ཁྲིའི་ཐོག་ཅ་ལག་སླར་གསོ་བྱེད་པ།",
        "དྲ་ཐོག་ཚོང་ཤག་ལ་མངགས་ཉོ་བྱེད་པ།",
        "སྐྱེལ་འདྲེན་གྱི་མངགས་ཐོ་ཐུམ་སྒྲིལ་བྱེད་པ།",
        "མངགས་ཉོ་སྐྱེལ་འདྲེན་རླངས་འཁོར་སྟེང་དུ་བླུགས་པ།",
        "ཚོང་ཤག་ལ་ཚོང་ཁང་ནང་ཅ་ལག་འཚོལ་རོགས་བྱེད་པ།",
        "མཛོད་ཁང་གཙང་སྦྲ་དང་གོ་རིམ་ལྡན་པ།",
        "ཚོང་ཤག་དང་ལས་བྱེད་པར་བདེ་འཇགས་དང་མཛའ་མཐུན་གྱི་ཁོར་ཡུག་སྲུང་སྐྱོང་བྱེད་པ།"
      ]
    }
  ],
  "skills": {
    "languages": [
      "ཇ་ཝ་སི་ཁི་རིཔཊ།",
      "ཡིག་གཟུགས་ཡིག་གཟུགས།",
      "པའེ་ཐན།",
      "ཇ་ཝ།",
      "C++",
      "SQL"
    ],
    "frameworks": [
      "ལན་འདེབས།",
      "Node.js",
      "མཚོན་པ",
      "ཇང་གོ།",
      "JQuery"
    ],
    "tools": [
      "གྷིཊ།",
      "ཌོག་ཀར།",
      "AWS",
      "ཇེན་ཀིན་སི།",
      "གུ་གུལ་སྤྲིན་སྟེགས་།"
    ],
    "databases": [
      "པོསཊ་གྷི་རེ་ཨེས་ཀིའུ་ཨེལ།",
      "MySQL",
      "ཁཱ་སན་ཌ་ར།"
    ]
  },
  "languages": [
    {
      "name": "དབྱིན་ཡིག",
      "proficiency": "ཐོན་ཡུལ"
    },
    {
      "name": "ཉི་ཧོང་སྐད།",
      "proficiency": "ཐོན་ཡུལ"
    }
  ],
  "projects": [
    {
      "name": "ཡིག་ཚགས།",
      "description": "དེང་རབས་ཀྱི་དྲ་རྒྱའི་ལག་རྩལ་སྤྱད་དེ་ལས་གཞི་དང་ལག་རྩལ་སྟོན་པའི་ལན་འདེབས་དྲ་ཚིགས།",
      "technologies": [
        "ལན་འདེབས།",
        "CSS3.",
        "ལན་འདེབས་ཇུས་འགོད།"
      ]
    }
  ]
}