{
  "name": "རི་ཀི་ཨི་ཝ་ས་ཀི།",
  "title": "མཉེན་ཆས་བཟོ་རིག་པ།",
  "contact": {
    "email": "rickyiwasaki@gmail.com",
    "phone": "+1 (949) 228-0083",
    "location": "Las Vegas, Nevada, USA",
    "linkedin": "linkedin.com/in/ricky-iwasaki",
    "github": "github.com/RickyIwasaki",
    "website": "https://ricky-iwasaki.com"
  },
  "summary": "ལས་འགུལ་སྦོམ་ཚུ་ནང་ལཱ་འབད་ནི་གི་གོ་སྐབས་གསརཔ་འཚོལ་མི་ ཉམས་མྱོང་ཅན་གྱི་མཉེན་ཆས་བཟོ་མི་ཅིག། གཞན་གྱིས་ལག་ལེན་འཐབ་ནིའི་དོན་ལུ་ གསང་ཡིག་གསར་བསྐྲུན་འབད་ནི་དང་ ཡང་ན་ ཁ་སྐོང་བརྐྱབ་ནི་ལུ་ སྤྲོ་བ་ཡོདཔ། ང་གིས་ ངེ་གི་རིག་རྩལ་འདི་ ཡོངས་འབྲེལ་དང་ཕྱདཔ་ད་ ཆུང་ཀུ་ཅིག་ཨིནམ་ལས་ གཞན་མི་ལག་ཆས་དང་ ཞབས་ཏོག་ ལས་རིམ་སྐད་ཡིག་ཚུ་དང་གཅིག་ཁར་ ལཱ་འབད་ནི་ལུ་ སྤྲོ་བ་སྦོམ་སྦེ་རང་ཡོདཔ་ཨིན།",
  "education": [
    {
      "degree": "མཉེན་ཆས་བཟོ་རིག་ལག་ཁྱེར།",
      "school": "སྤྲིན་བོརཌ་བུཊ་ཀེམཔ།",
      "dates": "༢༠༢༢ - ༢༠༢༣ བར།"
    },
    {
      "school": "ཀ་ལི་ཕོར་ནི་ཡ་མངའ་སྡེའི་ཕུལ་ལར་ཊོན་གཙུག་ལག་སློབ་སྡེ།",
      "location": "ཕུལ་ལར་ཊོན་ ཀ་ལི་ཕོར་ནི་ཡ་ ཡུ་ཨེས།",
      "dates": "༢༠༢༡ - ༢༠༢༢ བར།"
    },
    {
      "degree": "མཐོ་རིམ་སློབ་འབྲིང་གི་ལག་ཁྱེར།",
      "school": "ཝུཌ་བིརིཇ་མཐོ་རིམ་སློབ་གྲྭ།",
      "location": "ཨིར་ཝིན་ ཀ་ལི་ཕོར་ནི་ཡ་ ཡུ་ཨེས།",
      "dates": "༢༠༡༦ - ༢༠༢༡ བར།"
    }
  ],
  "experience": [
    {
      "title": "མཉེན་ཆས་བཟོ་རིག་པ།",
      "company": "MS-ZONE ཨེལ་ཨེལ་སི།",
      "location": "ཨིར་ཝིན་ ཀ་ལི་ཕོར་ནི་ཡ་ ཡུ་ཨེས།",
      "dates": "༢༠༢༣ - ༢༠༢༤ བར།",
      "responsibilities": [
        "React དང་ Node.js ལག་ལེན་འཐབ་སྟེ་ ཚད་འཇལ་ཚུགས་པའི་ ཝེབ་གློག་རིམ་ཚུ་ བཟོ་བཀོད་དང་ ལག་ལེན་འཐབ་ཡོདཔ།",
        "ཐོན་སྐྱེད་འཛིན་སྐྱོང་པ་ཚུ་དང་གཅིག་ཁར་ དགོས་མཁོ་ཚུ་ ལེགས་བཅོས་འབད་དེ་ དུས་ཚོད་ཁར་ བཀྲམ་སྤེལ་འབད་ནི་ལུ་ མཉམ་འབྲེལ་འབད་ཡོདཔ།",
        "ཝེབ་གློག་རིམ་གྱི་དོན་ལུ་ RESTful APIs གོང་འཕེལ་དང་རྒྱུན་སྐྱོང་འབད་ཡོདཔ།",
        "ལཱ་ཚུ་རང་བཞིན་བཟོ་ནི་དང་ ཇོན་ཐངས་ཡར་དྲག་གཏང་ནིའི་དོན་ལུ་ ཡིག་ཚུགས་བཟོ་ཡོདཔ།"
      ]
    },
    {
      "title": "ཊེ་ནིསི་སློབ་སྟོན་པ་ལས་རོགས།",
      "company": "ཨིར་ཝིན་ཁྲོམ་སྡེ།",
      "location": "ཨིར་ཝིན་ ཀ་ལི་ཕོར་ནི་ཡ་ ཡུ་ཨེས།",
      "dates": "༢༠༡༤ - ༢༠༡༩ ལུ།",
      "responsibilities": [
        "རྩེད་འགྲན་པ་༥-༡༠ གི་སྡེ་ཚན་ནང་ ཊེ་ནིསི་གི་ཐབས་ཤེས་སྟོན་ནི།",
        "རྩེད་འགྲན་པ་ཚུ་གི་དོན་ལུ་ སློབ་ཚན་འདི་ སྤྲོ་བ་ཅན་དང་ སྤྲོ་བ་ཅན་བཟོ་ནི།",
        "རྩེད་ཐང་ནང་ རྩེད་འགྲན་པ་ཚུ་གི་ ཉེན་སྲུང་དང་ དམིགས་བསལ་གྱིས་ རྩེད་འགྲན་པ་གཞོནམ་དང་ རྒས་ཤོས་ཚུ་ ལོ་༣ དང་༦༠ ལང་མི་བཟུམ་སྦེ་ འགན་ཁུར་འབག་དགོ།"
      ]
    },
    {
      "title": "ཕྱིར་ཐོན་ལས་རོགས།",
      "company": "ཨེ་མ་ཛོན་གསར་ཤོས།",
      "location": "ཨིར་ཝིན་ ཀ་ལི་ཕོར་ནི་ཡ་ ཡུ་ཨེས།",
      "dates": "༢༠༢༤ - ༢༠༢༤ བར།",
      "responsibilities": [
        "བང་སྒྲོམ་གུ་ཅ་ཆས་ཚུ་ ལོག་གསོག་འཇོག་འབད་དོ།",
        "ཡོངས་འབྲེལ་གྱི་ཚོང་མགྲོན་པ་ཚུ་གི་དོན་ལུ་ བཀའ་རྒྱ་བསྡུ་ནི།",
        "སྐྱེལ་འདྲེན་གྱི་དོན་ལུ་ བཀའ་རྒྱ་ཐུམ་སྒྲིལ་འབད་དོ།",
        "སྐྱེལ་འདྲེན་སྣུམ་འཁོར་ཚུ་ནང་ བཀའ་རྒྱ་ཚུ་ བཀལ་དོ།",
        "ཚོང་མགྲོན་པ་ཚུ་ལུ་ ཚོང་ཁང་ནང་ ཅ་ཆས་འཚོལ་ནི་ལུ་ གྲོགས་རམ་འབད་དོ།",
        "མཛོད་ཁང་གཙང་སྦྲ་དང་གོ་རིམ་སྒྲིག་སྟེ་བཞག་ནི།",
        "ཚོང་མགྲོན་པ་དང་ལས་བྱེདཔ་ཚུ་གི་དོན་ལུ་ ཉེན་སྲུང་དང་ལྡན་པའི་མཐའ་འཁོར་གནས་སྟངས་བཞག་ནི།"
      ]
    }
  ],
  "skills": {
    "languages": [
      "ཇ་བ་སི་ཀིརིཔཊི།",
      "ཊའིཔ་སི་ཀིརིཔཊི།",
      "པའི་ཐཱོན།",
      "ཇ་བ།",
      "C++",
      "ཨེསི་ཀིའུ་ཨེལ།"
    ],
    "frameworks": [
      "ལན་འདེབས།",
      "Node.js",
      "སླབ༌ནི",
      "ཇང་གོ་",
      "ཇེ་ཀིའུ་རི།"
    ],
    "tools": [
      "གིཊ།",
      "ཌོག་ཀར།",
      "AWS",
      "ཇེན་ཀིནསི།",
      "གུ་གུལ་ཀླད་ཀོར་སྟེགས་བུ།"
    ],
    "databases": [
      "པོསཊི་གྷི་རི་ཨེསི་ཀིའུ་ཨེལ།",
      "མའི་ཨེསི་ཀིའུ་ཨེལ།",
      "ཀ་སན་ཌར།"
    ]
  },
  "languages": [
    {
      "name": "ཨིང་ལིཤི་",
      "proficiency": "ཡུལ༌མི"
    },
    {
      "name": "ཇ་པཱན་གྱི་སྐད།",
      "proficiency": "ཡུལ༌མི"
    }
  ],
  "projects": [
    {
      "name": "ཡིག་ཚགས།",
      "description": "དེང་སང་གི་ཡོངས་འབྲེལ་འཕྲུལ་རིག་ཚུ་ལག་ལེན་འཐབ་སྟེ་ ལས་འགུལ་དང་རིག་རྩལ་ཚུ་སྟོན་མི་ ལན་འདེབས་ཅན་གྱི་ཡོངས་འབྲེལ་འཆར་སྒོ།",
      "technologies": [
        "ལན་འདེབས།",
        "CSS3.",
        "ལན་འདེབས་བཟོ་བཀོད།"
      ]
    }
  ]
}