{
  "name": "Ricky Iwasaki",
  "title": "ဆော့ဖ်ဝဲအင်ဂျင်နီယာ",
  "contact": {
    "email": "rickyiwasaki@gmail.com",
    "phone": "+1 (949) 228-0083",
    "location": "Las Vegas, Nevada, USA",
    "linkedin": "linkedin.com/in/ricky-iwasaki",
    "github": "github.com/RickyIwasaki",
    "website": "https://ricky-iwasaki.com"
  },
  "summary": "အတွေ့အကြုံရှိသော Software Developer သည် ကြီးမားသော ပရောဂျက်များအတွက် လုပ်ဆောင်ရန် အခွင့်အလမ်းသစ်များကို ရှာဖွေနေပါသည်။ အခြားသူများအသုံးပြုရန် ကုဒ်ဖန်တီးခြင်း သို့မဟုတ် ပေါင်းထည့်ခြင်းတို့ကို စိတ်ဝင်စားပါ။ ကျွန်ုပ်၏အရည်အချင်းများသည် အင်တာနက်နှင့် နှိုင်းယှဉ်ပါက သေးငယ်သည်ဟု ယုံကြည်သောကြောင့် အခြားကိရိယာများ၊ ဝန်ဆောင်မှုများ၊ ပရိုဂရမ်းမင်းဘာသာစကားများဖြင့် လုပ်ဆောင်ရန် အလွန်စိတ်ဝင်စားပါသည်။",
  "education": [
    {
      "degree": "Software Engineering လက်မှတ်",
      "school": "Springboard Bootcamp",
      "dates": "၂၀၂၂ - ၂၀၂၃"
    },
    {
      "school": "California State University of Fullerton",
      "location": "ဖူလာတန်၊ ကယ်လီဖိုးနီးယား၊ အမေရိကန်",
      "dates": "၂၀၂၁ - ၂၀၂၂"
    },
    {
      "degree": "အထက်တန်းကျောင်း ဒီပလိုမာ",
      "school": "Woodbridge အထက်တန်းကျောင်း",
      "location": "Irvine၊ ကယ်လီဖိုးနီးယား၊ အမေရိကန်",
      "dates": "၂၀၁၆ - ၂၀၂၁"
    }
  ],
  "experience": [
    {
      "title": "ဆော့ဖ်ဝဲအင်ဂျင်နီယာ",
      "company": "MS-ZONE LLC",
      "location": "Irvine၊ ကယ်လီဖိုးနီးယား၊ အမေရိကန်",
      "dates": "၂၀၂၃ - ၂၀၂၄",
      "responsibilities": [
        "React နှင့် Node.js ကို အသုံးပြု၍ အရွယ်တင်နိုင်သော ဝဘ်အက်ပလီကေးရှင်းများကို ဗိသုကာလုပ်ပြီး အကောင်အထည်ဖော်ခဲ့သည်။",
        "လိုအပ်ချက်များကို ပြန်လည်ပြင်ဆင်ရန်နှင့် အချိန်မီပေးပို့ရန် သေချာစေရန် ထုတ်ကုန်မန်နေဂျာများနှင့် ပူးပေါင်းဆောင်ရွက်ခဲ့ပါသည်။",
        "ဝဘ်အပလီကေးရှင်းများအတွက် RESTful API များကို တီထွင်ထိန်းသိမ်းထားသည်။",
        "လုပ်ဆောင်စရာများကို အလိုအလျောက်လုပ်ဆောင်ရန်နှင့် စွမ်းဆောင်ရည်မြှင့်တင်ရန် script များကို တီထွင်ခဲ့သည်။"
      ]
    },
    {
      "title": "လက်ထောက်တင်းနစ်နည်းပြ",
      "company": "Irvine မြို့",
      "location": "Irvine၊ ကယ်လီဖိုးနီးယား၊ အမေရိကန်",
      "dates": "2014 - 2019 ခုနှစ်",
      "responsibilities": [
        "တင်းနစ်နည်းစနစ်များကို ကစားသမား ၅-၁၀ ဦးဖြင့် အုပ်စုဖွဲ့ကာ သင်ကြားပေးခြင်း။",
        "သင်ခန်းစာကို ကစားသမားများအတွက် ပျော်ရွှင်စရာနှင့် စိတ်ဝင်စားဖွယ်ဖြစ်အောင် ဖန်တီးပါ။",
        "အထူးသဖြင့် အသက် ၃ နှစ် နှင့် အသက် ၆၀ အရွယ် လူငယ်များနှင့် အသက်ကြီးသော ကစားသမားများ တရားရုံးရှိ ကစားသမားများ၏ လုံခြုံရေးကို တာဝန်ယူ၊"
      ]
    },
    {
      "title": "အပြင်ဘက်တွဲဘက်",
      "company": "Amazon Fresh",
      "location": "Irvine၊ ကယ်လီဖိုးနီးယား၊ အမေရိကန်",
      "dates": "၂၀၂၄ - ၂၀၂၄",
      "responsibilities": [
        "စင်ပေါ်တွင် ပစ္စည်းများကို ပြန်လည်သိမ်းဆည်းခြင်း။",
        "အွန်လိုင်းဖောက်သည်များအတွက် အမှာစာများ ရွေးချယ်ခြင်း။",
        "ပို့ဆောင်ခြင်းအတွက် ထုပ်ပိုးခြင်း အော်ဒါများ",
        "အမှာစာများကို ပို့ဆောင်ရေးထရပ်ကားများပေါ်သို့ တင်ခြင်း။",
        "စတိုးဆိုင်ရှိ ပစ္စည်းများကို ဖောက်သည်များအား ကူညီရှာဖွေပေးသည်။",
        "ဂိုဒေါင်ကို သန့်ရှင်းသပ်ရပ်စွာ စနစ်တကျထားရှိခြင်း။",
        "ဖောက်သည်များနှင့် ဝန်ထမ်းများအတွက် လုံခြုံပြီး ဖော်ရွေသော ပတ်ဝန်းကျင်ကို ထိန်းသိမ်းပါ။"
      ]
    }
  ],
  "skills": {
    "languages": [
      "JavaScript",
      "TypeScript",
      "စပါးအုံး",
      "ဂျာဗား",
      "C++",
      "SQL"
    ],
    "frameworks": [
      "တုံ့ပြန်ပါ။",
      "Node.js",
      "အမြန်",
      "Django",
      "JQuery"
    ],
    "tools": [
      "Git",
      "Docker",
      "AWS",
      "Jenkins",
      "Google Cloud Platform"
    ],
    "databases": [
      "PostgreSQL",
      "MySQL",
      "Cassandra"
    ]
  },
  "languages": [
    {
      "name": "အင်္ဂလိပ်စာ",
      "proficiency": "ဇာတိ"
    },
    {
      "name": "ဂျပန်",
      "proficiency": "ဇာတိ"
    }
  ],
  "projects": [
    {
      "name": "အစုစု",
      "description": "ခေတ်မီဝဘ်နည်းပညာများကို အသုံးပြု၍ ပရောဂျက်များနှင့် ကျွမ်းကျင်မှုများကို ပြသသည့် တုံ့ပြန်နိုင်သော ဝဘ်ဆိုက်တစ်ခု",
      "technologies": [
        "တုံ့ပြန်ပါ။",
        "CSS3",
        "တုံ့ပြန်မှုဒီဇိုင်း"
      ]
    }
  ]
}