{
  "ideas": [
    {
      "id": "free-speech",
      "title": "Free Speech",
      "summary": "A fundamental right for functioning society",
      "icon": "💬",
      "fullContent": "I believe in free speech as a fundamental right and cornerstone of a functioning society because it allows for the exchange of ideas and power."
    },
    {
      "id": "instinct-based-structure",
      "title": "Instinct Based Structure",
      "summary": "Building society around instincts",
      "icon": "🧬",
      "fullContent": "Humans are animals, they behave in certain patterns. I believe we should have society built for the better using human instinct, like love, anger, greed, etc."
    },
    {
      "id": "existance",
      "title": "Reason for our Existance",
      "summary": "Acceleration of energy and resource processing",
      "icon": "🌌",
      "fullContent": "Meaning of everything to me is the acceleration of resource processing of energy. I believe some entity gave the universe the space and the big bang. And the pattern up to us known is that we might be spreading the energy out in space. As the universe ages, the system will get more complex, causing the acceleration of resource processing, like humanity expanding and dark energy."
    },
    {
      "id": "no-god",
      "title": "My God",
      "summary": "My religion",
      "icon": "❓",
      "fullContent": "I believe in no god :>"
    }
  ],
  "theories": [
    {
      "id": "influence-of-power",
      "title": "Influence of Power",
      "summary": "How power shapes our society",
      "icon": "⚡",
      "fullContent": "Power leads humanity, whether it's right or wrong, making a new good that normalizes the actions."
    },
    {
      "id": "change-in-morals",
      "title": "Change in Morals",
      "summary": "Progress often requires disruption",
      "icon": "🧠",
      "fullContent": "What seems morally good on the surface level of your community may not account for the complex mechanisms of human progress. Sometimes disruption leads to advancement. Just because harming innocent people is bad, doesn't mean we shouldn't do anything. Helping them realize a better idea might require some force. But whether that is the best way to do it, it depends on how much power a certain group people have."
    }
  ],
  "examples": [
    {
      "id": "pets",
      "title": "Pets",
      "summary": "On pet ownership",
      "icon": "🐱",
      "fullContent": "People should have the right to own pets, but I don't think people should have pets. There's been too many pets that are harming the area. People don't take good care of them like children and if they do then they are using up resources that could have been used on human children. And pets don't have protection like humans do, being abused a lot. Buying pets sponsors them and saving the thrown away pets, is like cleaning up their mess. It should be reported then taken care of. Otherwise the negative consequences aren't shown as easily. Or we can go the other route and treat pets as object. I personally only care about humans, so I only care about other animals just because others care about them so much. I am a person that wouldn't want any animal capable of harming a child on the streets, so that includes cats, dogs, birds, and etc (and quantity matters). Especially bears, there are people in the urban areas saying that the bear shouldn't be killed even though the bears are going after humans, so these rural people are getting hurt or having a risk of it."
    },
    {
      "id": "balance-with-power",
      "title": "Balance with Power",
      "summary": "Why good people need access to power",
      "icon": "⚖️",
      "fullContent": "Good people should have power. Bad people will try to get to their goal no matter what. Things like money, weapons, ideas, anything, are all accessible somehow, then that means we need to have as many powerful good people to have them to not have the bad people take over and restrict to just the bad people having them. If there are slaves owners, then there should be more good slave owners than bad ones. If there are gun owners, then there should be more good owners than bad ones. Regulating causes to have less good people having access to it and the number of bad people having access to this wont change that much, unless a reputable entity checks every resource at any point, which I don't think any entity is capable of this."
    },
    {
      "id": "moral-relativism",
      "title": "Moral Relativism",
      "summary": "Indirect good from seemingly bad actions",
      "icon": "🔄",
      "fullContent": "Are bad people bad? Yes. but they might have indirect good. Slavery is bad, but it might have helped accelerate resource extraction which helped give more resource to the community. Monopoly is bad, but it might have helped certain countries to be able to compete and stay afloat, increasing citizen and sometimes their quality of life. Makes me think bad people are bad but what should we do. Should we as a first world country take charge or let them be? We would have to invade and raid the current powers and implement our methods and ideas onto them, which would cost lots of resources and lives. Or should we let them continue to be bad people that take advantage of the vulnerable. However what we think is wrong doesn't mean they think it's wrong. They do their best to improve in their own way. Like how an individual shouldn't invade in others' personal space, communities shouldn't invade in other communities, countries shouldn't invade in other countries."
    },
    {
      "id": "investment-priority",
      "title": "Investment Priority",
      "summary": "Investing resources outward in concentric circles",
      "icon": "🎯",
      "fullContent": "Prioritize investment of resources as close to yourself (maybe, i don't know lol). First is yourself, health, a place to stay, and improvement. Then your group, people you trust, their health, a place to stay, improvement. Then community, investing in stores maybe. Then city, voting. Then country, maybe war (might be morally bad). Then global, alliance maybe."
    }
  ]
}